__author__ = "Andrey Gleykh"
__license__ = "GPL v.2.0"
__email__ = "gleykh@gmail.com"
__status__ = "Prototype"
__version__ = "0.9.7"

changelog = [
    ("0.8.2", "Изменена навигация по страницам с большим количеством записей"),
    ("0.8.3", "Внедрен просмотр реализованных изменений в программе"),
    ("0.8.4", "Добавлена возможность редактирования сведений об оборудовании"),
    ("0.9.1", "Реализована возможность перемещения оборудования между предприятиями"),
    ("0.9.5", "добавлен просмотр перемещений оборудования между предприятиями")
]

