from wh_app.supporting import functions

functions.info_string(__name__)

points_table = ['Название предприятия', 'Адрес предприятия', 'Текущий статус', 'Изменить']
points_table_name = 'Зарегистрированные предприятия'

equips_table = ['Предприятие', 'Наименование', 'Модель', 'Серийник', 'ID ранее', 'Действия']
equips_table_name = 'Зарегистрированнное оборудование'
equips_table_to_pdf = ['ID', 'Предприятие', 'Наименование', 'Модель', 'Серийник', 'ID ранее']

works_table = ['ID', 'Предприятие', 'Наименование', 'Модель', 'Номер', 'Дата', 'Заявка', 'Произведено',
               'Исполнители', 'Edit']
works_table_name = 'Произведенные работы'

all_workers_table_name = 'Все зарегистрированные сотрудники'
workers_table = ['ID', 'Фамилия', 'Имя', 'Телефон', 'Статус', 'Должность']

statistics_table_name = 'Сборная статистика по предприятиям'
statistics_table = ['Предприятие', 'Единиц оборудования', 'Выполнено работ', 'Дата последних работ']

system_status_table_name = "Доступность компонентов системы"
system_status_table = ['Комонент', 'Текущий статус']

works_days_table_name = 'Распределение сотрудников по предприятиям'
works_days_table = ['Предприятие', 'Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье']

workers_days_table_name = 'График по дням недели'
workers_days_table = ['Фамилия', 'Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье']

alter_works_days_table_name = 'Дополнительные привязки'
alter_works_days_table = ['Предприятие', 'Дополнительные сотрудники']

find_like_name = 'Поиск по совпадениям'
find_like_table = ['Введите часть наименования оборудования']
find_like_table_points = ['Введите часть наименования предприятия']

create_work_table_name = 'Регистрация нового ремонта'
create_work_table = ['Введите причину', 'Введите описание работ']

create_equip_table = ['Введите наименование оборудования', 'Введите марку оборудования(если есть)',
                      'Введите серийный номер(если есть)', 'Предыдущий ID(если есть)']
create_equip_name = 'Регистрация нового оборудования'

create_point_table = ['Введите название предприятия', 'Введите адрес предприятия']
create_point_name = 'Регистрация нового предприятия'

bugs_table = ['входящий №', 'Описание проблемы', 'Состояние']
bugs_table_name = 'Список известных проблем'


customers_table = ['ID', 'Полное имя']
customers_table_name = 'Все, кто имеет право регистрировать заявки'

orders_table = ['ID', 'Оформил', 'Дата', 'Описание', 'Текущий статус']
orders_table_name = 'Перечень заявок'

changelog_table = ['Program Version', 'Содержимое изменений']
changelog_table_name = 'Реализованные изменения'

remove_table_name = 'Перемещения оборудования'
remove_table = ['ID', 'Предприятие', 'Наименование', 'Модель', 'Серийник', 'ID Ранее']