"""Module contain all tables descriptions"""

from wh_app.supporting import functions

functions.info_string(__name__)


# All workspoints tables
points_table = ['Название предприятия', 'Адрес предприятия', 'Текущий статус', 'Изменить', 'Техпараметры']
points_table_name = 'Зарегистрированные предприятия'

point_tech_table_name = 'Сводная техническая информация по объекту'
point_tech_table = ['Наименование', 'Электроснабжение', 'Холодное Водоснабжение', 'Горячее водоснабжение',
                    'Отопление', 'Канализация']

create_point_table = ['Введите название предприятия', 'Введите адрес предприятия']
create_point_name = 'Регистрация нового предприятия'

top_10_points_name = 'TOP-10 предприятий по количеству работ'
top_10_points = ['ID', 'Наименование', 'Всего работ', 'Дата первой', 'Дата последней', 'За год', 'За месяц', 'За сутки']


# All equips tables
equips_table = ['Предприятие', 'Наименование', 'Модель', 'Серийник', 'ID ранее', 'Действия']
equips_table_name = 'Зарегистрированнное оборудование'
equips_table_to_pdf = ['ID', 'Предприятие', 'Наименование', 'Модель', 'Серийник', 'ID ранее']

create_equip_table = ['Введите наименование оборудования', 'Введите марку оборудования(если есть)',
                      'Введите серийный номер(если есть)', 'Предыдущий ID(если есть)']
create_equip_name = 'Регистрация нового оборудования'

remove_table_name = 'История перемещения оборудования'
remove_table = ['ID', 'Предприятие', 'Наименование', 'Модель', 'Серийник', 'ID Ранее', 'Действия']

top_10_equips_name = "Топ 10 оборудования по количеству ремонтов"
top_10_equips = ['ID', 'Предприятие', 'Наименование', 'Всего ремонтов', 'За год', 'За месяц']


# All works tables
works_table = ['ID', 'Предприятие', 'Наименование', 'Модель', 'Номер', 'Дата', 'Заявка', 'Произведено',
               'Исполнители', 'Действия']
works_table_name = 'Произведенные работы'

create_work_table_name = 'Регистрация нового ремонта'
create_work_table = ['Введите причину', 'Введите описание работ']


# All workers tables
all_workers_table_name = 'Все зарегистрированные сотрудники'
current_workers_table_name = 'Все сотрудники в штате'
workers_table = ['ID', 'Фамилия', 'Имя', 'Телефон', 'Статус', 'Должность', 'Дата приема', 'Дата увольнения', 'Действия']
only_works_workers = ['ID', 'Фамилия', 'Имя', 'Телефон', 'Статус', 'Должность', 'Дата приема', 'Действия']

works_days_table_name = 'Распределение сотрудников по предприятиям'
works_days_table = ['Предприятие', 'Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье']

workers_days_table_name = 'График по дням недели'
workers_days_table = ['Фамилия', 'Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье']

alter_works_days_table_name = 'Дополнительные привязки'
alter_works_days_table = ['Предприятие', 'Дополнительные сотрудники']

top_10_workers_table_name ='TOP-10 по количеству зарегистрированных работ'
top_10_workers_table = ['ID', 'Имя', 'Фамилия', 'Всего работ', 'За год', 'За месяц', 'За неделю']

schedule_table_name = 'График сотрудников по датам'
schedule_table = ['Дата', 'Имя', 'Фамилия', 'Должность', 'Телефон', 'Рабочие часы']


# All find tables
find_like_name = 'Поиск по совпадениям'
find_like_table = ['Введите часть наименования оборудования']
find_like_table_points = ['Введите часть наименования предприятия']


# All status tables
statistics_table_name = 'Сборная статистика по предприятиям'
statistics_table = ['Предприятие', 'Единиц оборудования', 'Выполнено работ', 'Дата последних работ']

system_status_table_name = "Доступность компонентов системы"
system_status_table = ['Комонент', 'Текущий статус']

changelog_table = ['Program Version', 'Содержимое изменений']
changelog_table_name = 'Реализованные изменения'


# All bugs tables
bugs_table = ['Входящий №', 'Описание проблемы', 'Состояние', 'Зарегистрировано', 'Закрыто','Изменить статус']
bugs_table_name = 'Список известных проблем'
bugs_in_work_table = ['Входящий №', 'Описание проблемы', 'Состояние', 'Дата регистрации', 'Изменить статус']


# All orders tables
customers_table = ['ID', 'Полное имя']
customers_table_name = 'Все, кто имеет право регистрировать заявки'

orders_table = ['ID', 'Предприятие', 'Оформил', 'Зарегистрировано', 'Закрыто/отменено', 'Описание', 'Текущий статус',
                'Комментарий', 'Действия']
orders_table_name = 'Перечень заявок'

orders_table_no_closed = ['ID', 'Предприятие', 'Оформил', 'Зарегистрировано', 'Закрыто/отменено', 'Описание', 'Текущий статус',
                'Комментарий', 'Позиция в очереди' ,'Действия']


# Electric company tables
eens_table_name = 'По данным Екатеринбургэнергосбыт'
eens_table = ['N телефонограммы', 'Начало', 'Окончание', 'Обьекты', 'Улицы', 'Ссылка на телефонограмму']
eesk_table_name = 'По данным Екатеринбургской Электросетевой Компании'
eesk_table = ['Город', 'Улицы', 'Начало', 'Окончание']



