"""Module contain all tables descriptions"""

from wh_app.supporting import functions

functions.info_string(__name__)


# All workspoints tables
points_table = ['Название предприятия', 'Адрес предприятия', 'Текущий статус', 'Изменить', 'Техпараметры']
points_table_ext = ['Головное предприятие', 'Название предприятия', 'Адрес предприятия', 'Текущий статус',
                    'Изменить', 'Техпараметры']
points_table_name = 'Зарегистрированные предприятия'

point_tech_table_name = 'Сводная техническая информация по объекту'
point_tech_table = ['Наименование', 'Электроснабжение', 'Холодное Водоснабжение', 'Горячее водоснабжение',
                    'Отопление', 'Канализация']

create_point_table = ['Введите название предприятия', 'Введите адрес предприятия']
create_point_name = 'Регистрация нового предприятия'

top_10_points_name = 'TOP-10 предприятий по количеству работ'
top_10_points = ['ID', 'Наименование', 'Всего работ', 'Дата первой', 'Дата последней', 'За год', 'За месяц', 'За сутки']


# All meters devices tables
meter_devices_table = ['ID', 'Предприятие', 'Статус прибора', 'Назначение','Тип прибора', 'Модель', "№", 'Дата установки',
                       'Дата демонтажа', 'Дата поверки', 'Примечание']
meter_devices_table_ext = ['<a href="{0}/1" title="Сортировать по Учетной Записи" class="header-link">ID</a>',
                           '<a href="{0}/2" title="Сортировать по Предприятию" class="header-link">Предприятие</a>',
                           '<a href="{0}/3" title="Сортировать по Статусу Прибора" class="header-link">Статус Прибора</a>',
                           '<a href="{0}/4" title="Сортировать по Назначению" class="header-link">Назначение</a>',
                           '<a href="{0}/5" title="Сортировать по Типу Прибора" class="header-link">Тип Прибора</a>',
                           '<a href="{0}/6" title="Сортировать по Модели" class="header-link">Модель</a>',
                           '<a href="{0}/7" title="Сортировать по Серийному Номеру" class="header-link">№</a>',
                           '<a href="{0}/8" title="Сортировать по Дате Установки" class="header-link">Дата Установки</a>',
                           '<a href="{0}/9" title="Сортировать по Дате Демонтажа" class="header-link">Дата демонтажа</a>',
                           '<a href="{0}/10" title="Сортировать по Дате Поверки" class="header-link">Дата Поверки</a>',
                           '<a href="{0}/11" title="Сортировать по Примечанию" class="header-link">Примечание</a>']
meter_devices_table_name = 'Перечень приборов учета'
readings_device_table = ['Учетный номер записи', 'Серийный № ПУ', 'Дата показаний', 'Показания', 'Разность',
                         'Коэфф.', 'Расход за период', 'В среднем за сутки']
readings_device_table_name = 'История показаний по прибору учета'
small_readings_table = ['ID', 'Дата', 'Показания']
small_readings_table_name = 'История показаний прибора учета №{0}({1}, {2})' # Серийный номер, название точки, раздел учета

calc_schemes_table_name = 'Расчетные схемы'
calc_schemes_table = ['ID схемы', 'Раздел', 'ID входных приборов учета', 'ID вычитаемых приборов учета', 'Комментарий', 'Ед. изм.',
                      'Среднее в сутки', 'Расчетное потребление в текущем месяце', 'По истории ПУ за последний месяц']


# All equips tables
equips_table = ['Предприятие', 'Наименование', 'Модель', 'Серийник', 'ID ранее', 'Действия']
equips_table_name = 'Зарегистрированнное оборудование'
equips_table_ext = ['<a href="{0}/2" title="Сортировать по Предприятию" class="header-link">Предприятие</a>',
                    '<a href="{0}/3" title="Сортировать по Названию" class="header-link">Название</a>',
                    '<a href="{0}/4" title="Сортировать по Модели" class="header-link">Модель</a>',
                    '<a href="{0}/5" title="Сортировать по Серийному номеру" class="header-link">Серийник</a>',
                    '<a href="{0}/6" title="Сортировать по Предыдущему ID" class="header-link">ID ранее</a>', 'Действия']
equips_table_to_pdf = ['ID', 'Предприятие', 'Наименование', 'Модель', 'Серийник', 'ID ранее']

create_equip_table = ['Введите наименование оборудования', 'Введите марку оборудования(если есть)',
                      'Введите серийный номер(если есть)', 'Предыдущий ID(если есть)']
create_equip_name = 'Регистрация нового оборудования'

remove_table_name = 'История перемещения оборудования'
remove_table = ['ID', 'Предприятие', 'Наименование', 'Модель', 'Серийник', 'ID Ранее', 'Действия']

top_10_equips_name = "Топ 10 оборудования по количеству ремонтов"
top_10_equips = ['ID', 'Предприятие', 'Наименование', 'Всего ремонтов', 'За год', 'За месяц']

equip_types_name = 'Зарегистрированные подтипы оборудования'
equip_types = ['Type ID', 'Общий тип', 'Подтип', 'Каталог для деталировок', 'Описание', 'Действия']

exist_detail_name = 'Доступные деталировки'
exist_detail = ['ID деталировки', 'Краткое описание']

exist_manual_name = 'Доступные инструкции'
exist_manual = ['ID инструкции', 'Краткое описание']


# All works tables
works_table = ['ID', 'Предприятие', 'Наименование', 'Модель', 'Номер', 'Дата', 'Заявка', 'Произведено',
               'Исполнители', 'Действия']
works_table_ext = ['<a href="{0}/1" title="Сортировать по номеру" class="header-link">ID</a>',
                   '<a href="{0}/2" title="Сортировать по Предприятию" class="header-link">Предприятие</a>',
                   '<a href="{0}/3" title="Сортировать по Наименованию" class="header-link">Наименование</a>',
                   '<a href="{}/4" title="Сортировать по Модели" class="header-link">Модель</a>',
                   '<a href="{}/5" title="Сортировать по Серийному номеру" class="header-link">Номер</a>',
                   '<a href="{}/6" title="Сортировать по Дате" class="header-link">Дата</a>',
                   '<a href="{}/7" title="Сортировать по Причине" class="header-link">Заявка</a>',
                   '<a href="{}/8" title="Сортировать по Содержимому работ" class="header-link">Произведено</a>',
                   '<a href="{}/9" title="Сортировать по Исполнителям" class="header-link">Исполнители</a>',
                   'Действия']
works_table_name = 'Произведенные работы'

create_work_table_name = 'Регистрация нового ремонта'
create_work_table = ['Введите причину', 'Введите описание работ']


# All workers tables
all_workers_table_name = 'Все зарегистрированные сотрудники'
current_workers_table_name = 'Все сотрудники в штате'
workers_table = ['ID', 'Фамилия', 'Имя', 'Телефон', 'Статус', 'Должность', 'Дата приема', 'Дата увольнения', 'Действия']
only_works_workers = ['ID', 'Фамилия', 'Имя', 'Телефон', 'Статус', 'Должность', 'Дата приема', 'Действия']

works_days_table_name = 'Распределение сотрудников по предприятиям'
works_days_table = ['Предприятие', 'Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье']

workers_days_table_name = 'График по дням недели'
workers_days_table = ['Фамилия', 'Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье']

alter_works_days_table_name = 'Дополнительные привязки'
alter_works_days_table = ['Предприятие', 'Дополнительные сотрудники']

top_10_workers_table_name ='TOP-10 по количеству зарегистрированных работ'
top_10_workers_table = ['ID', 'Имя', 'Фамилия', 'Всего работ', 'За год', 'За месяц', 'За неделю']

schedule_table_name = 'График сотрудников по датам'
schedule_table = ['Дата', 'Имя', 'Фамилия', 'Должность', 'Телефон', 'Рабочие часы']


# All find tables
find_like_name = 'Поиск по совпадениям'
find_like_table = ['Введите часть наименования оборудования']
find_like_table_points = ['Введите часть наименования предприятия']


# All status tables
statistics_table_name = 'Сборная статистика по предприятиям'
statistics_table = ['Предприятие', 'Единиц оборудования', 'Выполнено работ', 'Дата последних работ']
statistics_table_ext = ['<a href="{}/2" title="Сортировать по Названию предприятия" class="header-link">Предприятие</a>',
                        '<a href="{}/3" title="Сортировать по Количеству оборудования" class="header-link">Единиц оборудования</a>',
                        '<a href="{}/4" title="Сортировать по Количеству выполненных работ" class="header-link">Выполнено работ</a>',
                        '<a href="{}/5" title="Сортировать по Дате последних работ" class="header-link">Дата последних работ</a>']

system_status_table_name = "Доступность компонентов системы"
system_status_table = ['Комонент', 'Текущий статус']

changelog_table = ['Program Version', 'Содержимое изменений']
changelog_table_name = 'Реализованные изменения'


# All bugs tables
bugs_table = ['Входящий №', 'Описание проблемы', 'Состояние', 'Зарегистрировано', 'Закрыто','Изменить статус']
bugs_table_name = 'Список известных проблем'
bugs_in_work_table = ['Входящий №', 'Описание проблемы', 'Состояние', 'Дата регистрации', 'Изменить статус']


# All orders tables
customers_table = ['ID', 'Псевдоним', 'Полное имя', 'Статус', 'Действия']
customers_table_name = 'Все, кто имеет право регистрировать заявки'

orders_table = ['ID', 'Предприятие', 'Оформил', 'Зарегистрировано', 'Закрыто/отменено', 'Описание', 'Текущий статус',
                'Комментарий', 'Назначен исполнитель', 'Действия']
orders_table_ext = ['<a href="{}/1" title="Сортировать по ID" class="header-link">ID</a>',
                    '<a href="{}/2" title="Сортировать по Предприятию" class="header-link">Предприятие</a>',
                    '<a href="{}/3" title="Сортировать по Заказчику" class="header-link">Оформил</a>',
                    '<a href="{}/4" title="Сортировать по Дате регистрации" class="header-link">Зарегистрировано</a>',
                    '<a href="{}/5" title="Сортировать по Дате закрытия" class="header-link">Закрыто/Отменено</a>',
                    '<a href="{}/6" title="Сортировать по Содержимому заявки" class="header-link">Описание</a>',
                    '<a href="{}/7" title="Сортировать по Текущему статусу" class="header-link">Текущий статус</a>',
                    '<a href="{}/8" title="Сортировать по Примечаниям к заявке" class="header-link">Комментарий</a>',
                    '<a href="{}/9" title="Сортировать по Назначенному исполнителю" class="header-link">Назначен исполнитель</a>',
                    'Действия']
orders_table_name = 'Перечень заявок'

orders_table_no_closed = ['ID', 'Предприятие', 'Оформил', 'Зарегистрировано', 'Закрыто/отменено', 'Описание', 'Текущий статус',
                'Комментарий', 'Назначен исполнитель','Позиция в очереди' ,'Действия']
orders_table_no_closed_ext = ['<a href="{}/1" title="Сортировать по ID" class="header-link">ID</a>',
                              '<a href="{}/2" title="Сортировать по Предприятию" class="header-link">Предприятие</a>',
                              '<a href="{}/3" title="Сортировать по Заказчику" class="header-link">Оформил</a>',
                              '<a href="{}/4" title="Сортировать по Дате регистрации" class="header-link">Зарегистрировано</a>',
                              '<a href="{}/5" title="Сортировать по Дате закрытия" class="header-link">Закрыто/Отменено</a>',
                              '<a href="{}/6" title="Сортировать по Содержимому заявки" class="header-link">Описание</a>',
                              '<a href="{}/7" title="Сортировать по Текущему статусу" class="header-link">Текущий статус</a>',
                              '<a href="{}/8" title="Сортировать по Примечаниям к заявке" class="header-link">Комментарий</a>',
                              '<a href="{}/9" title="Сортировать по Назначенному исполнителю" class="header-link">Назначен исполнитель</a>',
                              'Позиция в очереди','Действия']


# Electric company tables
eens_table_name = 'По данным Екатеринбургэнергосбыт'
eens_table = ['N телефонограммы', 'Начало', 'Окончание', 'Обьекты', 'Улицы', 'Ссылка на телефонограмму']
eesk_table_name = 'По данным Екатеринбургской Электросетевой Компании'
eesk_table = ['Город', 'Улицы', 'Начало', 'Окончание']



